In [1]:

import numpy as np
import pandas as pd

In [3]:

# load dataset:
titanic = pd.read_csv(filepath_or_buffer="dataset/titanic.csv")

# print a single column: 
titanic["age"]

0           29
1       0.9167
2            2
3           30
4           25
         ...
1304      14.5
1305         ?
1306      26.5
1307        27
1308        29
Name: age, Length: 1309, dtype: object

In [4]:

# we can also print like: 
titanic.age

0           29
1       0.9167
2            2
3           30
4           25
         ...
1304      14.5
1305         ?
1306      26.5
1307        27
1308        29
Name: age, Length: 1309, dtype: object

In [5]:

# it's a pandas.Serics:
type(titanic.age)

pandas.core.series.Series

In [6]:

# dynamically fetch data:
var = "age"
titanic[var]

0           29
1       0.9167
2            2
3           30
4           25
         ...
1304      14.5
1305         ?
1306      26.5
1307        27
1308        29
Name: age, Length: 1309, dtype: object


<br>

# #Pandas Serics:

**Series:** One-dimentional ndarray with axis level. 

<br>

In [8]:
type(titanic.mean(numeric_only=True))

pandas.core.series.Series

In [9]:
houses = pd.read_csv(filepath_or_buffer="dataset/kc_house_data.csv")
houses.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [10]:
type(houses.columns)

pandas.core.indexes.base.Index

In [12]:

# total prices:
houses.price.sum()

np.float64(11672925008.0)

In [13]:

# minimum price:
houses.price.min()

np.float64(75000.0)

In [14]:

# maximum price:
houses.price.max()

np.float64(7700000.0)

In [16]:

# shape: 
print("shpae property in dataFrame {}".format(houses.shape))
print("shpae property in serics {}".format(houses.price.shape))

shpae property in dataFrame (21613, 21)
shpae property in serics (21613,)

In [21]:

# dimentional of serics:
houses.price.ndim

1

In [22]:

# values of serics:
houses.condition.values

array([3, 3, 3, ..., 3, 3, 3], shape=(21613,))

In [27]:

min = houses.min(numeric_only=True)
min

id               1.000102e+06
price            7.500000e+04
bedrooms         0.000000e+00
bathrooms        0.000000e+00
sqft_living      2.900000e+02
sqft_lot         5.200000e+02
floors           1.000000e+00
waterfront       0.000000e+00
view             0.000000e+00
condition        1.000000e+00
grade            1.000000e+00
sqft_above       2.900000e+02
sqft_basement    0.000000e+00
yr_built         1.900000e+03
yr_renovated     0.000000e+00
zipcode          9.800100e+04
lat              4.715590e+01
long            -1.225190e+02
sqft_living15    3.990000e+02
sqft_lot15       6.510000e+02
dtype: float64

In [28]:
min.values

array([ 1.000102e+06,  7.500000e+04,  0.000000e+00,  0.000000e+00,
        2.900000e+02,  5.200000e+02,  1.000000e+00,  0.000000e+00,
        0.000000e+00,  1.000000e+00,  1.000000e+00,  2.900000e+02,
        0.000000e+00,  1.900000e+03,  0.000000e+00,  9.800100e+04,
        4.715590e+01, -1.225190e+02,  3.990000e+02,  6.510000e+02])

In [29]:
min.index

Index(['id', 'price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot',
       'floors', 'waterfront', 'view', 'condition', 'grade', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode', 'lat', 'long',
       'sqft_living15', 'sqft_lot15'],
      dtype='object')


<br>
<br>

# #Important Serics Method: 

- head()
- tail()
- describe()
- unique()
- nunique()
- nlargest()
- nsmallest()
- value_counts()
- plot

<br>
<br>

In [31]:

# 1st 5 values:
titanic.name.head(5), type(titanic.name.head(5))

(0                      Allen, Miss. Elisabeth Walton
 1                     Allison, Master. Hudson Trevor
 2                       Allison, Miss. Helen Loraine
 3               Allison, Mr. Hudson Joshua Creighton
 4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
 Name: name, dtype: object,
 pandas.core.series.Series)

In [35]:

# describe in serics:
titanic["pclass"].describe()

count    1309.000000
mean        2.294882
std         0.837836
min         1.000000
25%         2.000000
50%         3.000000
75%         3.000000
max         3.000000
Name: pclass, dtype: float64

In [37]:
# describe on categoriacl data: 
titanic["name"].describe()

count                 1309
unique                1307
top       Kelly, Mr. James
freq                     2
Name: name, dtype: object

In [39]:

#check dytpe of a serics:
titanic["name"].dtypes # dtype('O') = object

dtype('O')

In [40]:

# unique value is in dataFrame:

try:
    print(houses.unique)
except Exception as e:
    print(f"error: {e}")

error: 'DataFrame' object has no attribute 'unique'

In [42]:

# unique in Serics:
houses.bathrooms.unique() # get all the unique value

array([1.  , 2.25, 3.  , 2.  , 4.5 , 1.5 , 2.5 , 1.75, 2.75, 3.25, 4.  ,
       3.5 , 0.75, 4.75, 5.  , 4.25, 3.75, 0.  , 1.25, 5.25, 6.  , 0.5 ,
       5.5 , 6.75, 5.75, 8.  , 7.5 , 7.75, 6.25, 6.5 ])

In [45]:

netflix = pd.read_csv("dataset/netflix_titles.csv",sep="|")

In [ ]:
# get unique values: 
netflix.rating.unique()

array(['PG-13', 'TV-MA', 'PG', 'TV-14', 'TV-PG', 'TV-Y', 'TV-Y7', 'R',
       'TV-G', 'G', 'NC-17', '74 min', '84 min', '66 min', 'NR', nan,
       'TV-Y7-FV', 'UR'], dtype=object)

In [53]:

# total number of unique value():
netflix.rating.nunique()

17

In [52]:

# in rating we have total 4 null values:
netflix.rating.isnull().sum()

np.int64(4)

In [ ]:

# we have null value is our serics: 
# by default, nunique don't incluse null values, but unique does: 
netflix["rating"].unique() # we have nan in the ouput total: 18 values

array(['PG-13', 'TV-MA', 'PG', 'TV-14', 'TV-PG', 'TV-Y', 'TV-Y7', 'R',
       'TV-G', 'G', 'NC-17', '74 min', '84 min', '66 min', 'NR', nan,
       'TV-Y7-FV', 'UR'], dtype=object)

In [60]:

# count with null values; 
netflix.rating.nunique(dropna=False) # now we got total: 18

18

In [61]:

# by default: 
netflix.rating.nunique(dropna=True)

17

In [63]:


# nlarge for finding: top 5 height number: 
houses["price"].nlargest()

7252    7700000.0
3914    7062500.0
9254    6885000.0
4411    5570000.0
1448    5350000.0
Name: price, dtype: float64

In [65]:

# smallest 5 values: 
houses["price"].nsmallest()

1149     75000.0
15293    78000.0
465      80000.0
16198    81000.0
8274     82000.0
Name: price, dtype: float64

In [70]:

# find all the vlaue from a dataFrame base on larger:
# best on price we get top 5 columns
houses.nlargest(5,["price"])

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
7252,6762700020,20141013T000000,7700000.0,6,8.00,12050,27600,2.5,0,3,...,13,8570,3480,1910,1987,98102,47.6298,-122.323,3940,8800
3914,9808700762,20140611T000000,7062500.0,5,4.50,10040,37325,2.0,1,2,...,11,7680,2360,1940,2001,98004,47.6500,-122.214,3930,25449
9254,9208900037,20140919T000000,6885000.0,6,7.75,9890,31374,2.0,0,4,...,13,8860,1030,2001,0,98039,47.6305,-122.240,4540,42730
4411,2470100110,20140804T000000,5570000.0,5,5.75,9200,35069,2.0,0,0,...,13,6200,3000,2001,0,98039,47.6289,-122.233,3560,24345
1448,8907500070,20150413T000000,5350000.0,5,5.00,8000,23985,2.0,0,4,...,12,6720,1280,2009,0,98004,47.6232,-122.220,4600,21750

In [72]:

# base on bedrooms:
houses.nlargest(n=10,columns=["bedrooms"])

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
15870,2402100895,20140625T000000,640000.0,33,1.75,1620,6000,1.0,0,0,...,7,1040,580,1947,0,98103,47.6878,-122.331,1330,4700
8757,1773100755,20140821T000000,520000.0,11,3.00,3000,4960,2.0,0,0,...,7,2400,600,1918,1999,98106,47.5560,-122.363,1420,4960
13314,627300145,20140814T000000,1148000.0,10,5.25,4590,10920,1.0,0,2,...,9,2500,2090,2008,0,98004,47.5861,-122.113,2730,10400
15161,5566100170,20141029T000000,650000.0,10,2.00,3610,11914,2.0,0,0,...,7,3010,600,1958,0,98006,47.5705,-122.175,2040,11914
19254,8812401450,20141229T000000,660000.0,10,3.00,2920,3745,2.0,0,0,...,7,1860,1060,1913,0,98105,47.6635,-122.320,1810,3745
4096,1997200215,20140507T000000,599999.0,9,4.50,3830,6988,2.5,0,0,...,7,2450,1380,1938,0,98103,47.6927,-122.338,1460,6291
4235,2902200015,20150106T000000,700000.0,9,3.00,3680,4400,2.0,0,0,...,7,2830,850,1908,0,98102,47.6374,-122.324,1960,2450
6079,9822700190,20140808T000000,1280000.0,9,4.50,3650,5000,2.0,0,0,...,8,2530,1120,1915,2010,98105,47.6604,-122.289,2510,5000
8546,424049043,20140811T000000,450000.0,9,7.50,4050,6504,2.0,0,0,...,7,4050,0,1996,0,98144,47.5923,-122.301,1448,3866
16844,8823900290,20150317T000000,1400000.0,9,4.00,4620,5508,2.5,0,0,...,11,3870,750,1915,0,98105,47.6684,-122.309,2710,4320

In [73]:

# base on bedrooms,then, bathrooms:
houses.nlargest(n=10,columns=["bedrooms","bathrooms"])

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
15870,2402100895,20140625T000000,640000.0,33,1.75,1620,6000,1.0,0,0,...,7,1040,580,1947,0,98103,47.6878,-122.331,1330,4700
8757,1773100755,20140821T000000,520000.0,11,3.00,3000,4960,2.0,0,0,...,7,2400,600,1918,1999,98106,47.5560,-122.363,1420,4960
13314,627300145,20140814T000000,1148000.0,10,5.25,4590,10920,1.0,0,2,...,9,2500,2090,2008,0,98004,47.5861,-122.113,2730,10400
19254,8812401450,20141229T000000,660000.0,10,3.00,2920,3745,2.0,0,0,...,7,1860,1060,1913,0,98105,47.6635,-122.320,1810,3745
15161,5566100170,20141029T000000,650000.0,10,2.00,3610,11914,2.0,0,0,...,7,3010,600,1958,0,98006,47.5705,-122.175,2040,11914
8546,424049043,20140811T000000,450000.0,9,7.50,4050,6504,2.0,0,0,...,7,4050,0,1996,0,98144,47.5923,-122.301,1448,3866
4096,1997200215,20140507T000000,599999.0,9,4.50,3830,6988,2.5,0,0,...,7,2450,1380,1938,0,98103,47.6927,-122.338,1460,6291
6079,9822700190,20140808T000000,1280000.0,9,4.50,3650,5000,2.0,0,0,...,8,2530,1120,1915,2010,98105,47.6604,-122.289,2510,5000
16844,8823900290,20150317T000000,1400000.0,9,4.00,4620,5508,2.5,0,0,...,11,3870,750,1915,0,98105,47.6684,-122.309,2710,4320
4235,2902200015,20150106T000000,700000.0,9,3.00,3680,4400,2.0,0,0,...,7,2830,850,1908,0,98102,47.6374,-122.324,1960,2450

In [74]:


# n smalledst: 

houses.nsmallest(5,"price")

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
1149,3421079032,20150217T000000,75000.0,1,0.00,670,43377,1.0,0,0,...,3,670,0,1966,0,98022,47.2638,-121.906,1160,42882
15293,40000362,20140506T000000,78000.0,2,1.00,780,16344,1.0,0,0,...,5,780,0,1942,0,98168,47.4739,-122.280,1700,10387
465,8658300340,20140523T000000,80000.0,1,0.75,430,5050,1.0,0,0,...,4,430,0,1912,0,98014,47.6499,-121.909,1200,7500
16198,3028200080,20150324T000000,81000.0,2,1.00,730,9975,1.0,0,0,...,5,730,0,1943,0,98168,47.4808,-122.315,860,9000
8274,3883800011,20141105T000000,82000.0,3,1.00,860,10426,1.0,0,0,...,6,860,0,1954,0,98146,47.4987,-122.341,1140,11250

In [75]:

# video no:06,07,08